Revit 2026 API

# UnderlayOrientation Enumeration

---

Indicates how elements in the underlay are viewed.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum UnderlayOrientation
```
```vb
Public Enumeration UnderlayOrientation
```
```cpp
public enum class UnderlayOrientation
```
```fsharp
type UnderlayOrientation
```

| Member name | Value | Description |
| --- | --- | --- |
| LookingDown | 0 | Underlay elements are viewed as if looking down from above. |
| LookingUp | 1 | Underlay elements are viewed as if looking up from below. |

#### Reference

Autodesk.Revit.DB Namespace